---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MepProfileTypeParam
source: html/90475306-8a5f-59ce-8160-9d5560b8b1e9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MepProfileTypeParam Property

"Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId MepProfileTypeParam { get; }
```